{
  "class_name": "Model",
  "config": {
    "name": "model_1",
    "layers": [
      {
        "name": "input_RAC_plot",
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            162
          ],
          "dtype": "float32",
          "sparse": false,
          "name": "input_RAC_plot"
        },
        "inbound_nodes": []
      },
      {
        "name": "dense_1",
        "class_name": "Dense",
        "config": {
          "name": "dense_1",
          "trainable": true,
          "units": 500,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.019999999552965164
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "input_RAC_plot",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_1",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_1",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "dense_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_1",
        "class_name": "Activation",
        "config": {
          "name": "activation_1",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "alpha_drop_plot_0",
        "class_name": "AlphaDropout",
        "config": {
          "name": "alpha_drop_plot_0",
          "trainable": true,
          "rate": 0.1
        },
        "inbound_nodes": [
          [
            [
              "activation_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dense_2",
        "class_name": "Dense",
        "config": {
          "name": "dense_2",
          "trainable": true,
          "units": 500,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 0.019999999552965164
            }
          },
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "alpha_drop_plot_0",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_2",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_2",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "dense_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_2",
        "class_name": "Activation",
        "config": {
          "name": "activation_2",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "alpha_drop_plot_1",
        "class_name": "AlphaDropout",
        "config": {
          "name": "alpha_drop_plot_1",
          "trainable": true,
          "rate": 0.1
        },
        "inbound_nodes": [
          [
            [
              "activation_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "output_reg",
        "class_name": "Dense",
        "config": {
          "name": "output_reg",
          "trainable": true,
          "units": 1,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "alpha_drop_plot_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_3",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_3",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "output_reg",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_3",
        "class_name": "Activation",
        "config": {
          "name": "activation_3",
          "trainable": true,
          "activation": "sigmoid"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_3",
              0,
              0,
              {}
            ]
          ]
        ]
      }
    ],
    "input_layers": [
      [
        "input_RAC_plot",
        0,
        0
      ]
    ],
    "output_layers": [
      [
        "activation_3",
        0,
        0
      ]
    ]
  },
  "keras_version": "2.2.2",
  "backend": "tensorflow"
}
