{
  "class_name": "Sequential",
  "config": [
    {
      "class_name": "Dense",
      "config": {
        "name": "dense_7",
        "trainable": true,
        "batch_input_shape": [
          null,
          153
        ],
        "dtype": "float32",
        "units": 500,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "RandomNormal",
          "config": {
            "mean": 0.0,
            "stddev": 0.05,
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": {
          "class_name": "L1L2",
          "config": {
            "l1": 0.0,
            "l2": 0.00010128982103196904
          }
        },
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "name": "dropout_5",
        "trainable": true,
        "rate": 0.2205915003245826,
        "noise_shape": null,
        "seed": null
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "name": "dense_8",
        "trainable": true,
        "units": 500,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "RandomNormal",
          "config": {
            "mean": 0.0,
            "stddev": 0.05,
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": {
          "class_name": "L1L2",
          "config": {
            "l1": 0.0,
            "l2": 0.00010128982103196904
          }
        },
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "name": "dropout_6",
        "trainable": true,
        "rate": 0.2205915003245826,
        "noise_shape": null,
        "seed": null
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "name": "dense_9",
        "trainable": true,
        "units": 1,
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    }
  ],
  "keras_version": "2.1.3",
  "backend": "tensorflow"
}
